#Сообщения для бота, которые можно легко настроить
#К каждому сообщению идет описание
#ВАЖНО! parse_mode='Markdown'

#Импорт основного файла для получения ID пользователя и реферала
#Настройка БД



#При отправке любого сообщения не соотв.условию в обработчике сообщения
ERROR_message = ('❌ Неизвестная команда!\n\n_Вы отправили сообщение напрямую в чат бота, или структура меню была изменена Админом._\n\nℹ️ Не отправляйте прямых сообщений боту или обновите Меню, нажав /start')

#Приветственное сообщение
WELCOME_message = ('Чтобы участвовать в AIRDROP, Вам необходимо сначала подписаться на канал: @smiletonn')

#Главное меню
MENU_message = ('*AIRDROP SMILE COIN*\n\n*200 $SMILE* - за одного приведенного друга ? \n😱Это самые лучшие условия для масштабного AIRDOP !\n\nНичего проще не бывает! Абсолютно каждый участник получит *DROP* от *SMILE* Жми на кнопу «условия», там все подробности! Вперед!\n\n@smiletonn')

#Условия
Terms_message = ('*УСЛОВИЯ \\ TERMS 📃*\n\nУсловия участия в AIRDROP не были еще такими простыми 😱\nАбсолютно каждый участник получит токены $PEPE 🔥\nЧтобы участвовать, Вам необходимо:\n1. Быть подписанным на канал: @smiletonn\n2. Пригласить всех друзей\n\nЗа каждого приведённого друга, вы получите *200* $SMILE\n\n_Чтобы удвоить реферальный баланс, выполните дополнительное бонусное условие во вкладке Twitter[BONUS]._\n\nВы можете приглашать друзей по вашей персональной реферальной ссылке: Here Referal LINK\n\n_пригласить/invite👇🏼_')

#Баланс
Balance_message = ('Ваш баланс:\n_1 ref. = 200 $SMILE_\n\nЧтобы умножить ваш баланс на х2, выполните простое условие во вкладке Twitter\n\n_Пригласить больше друзей 👇🏼_')

#Кошелек
Wallet_message = ('*Ваш кошелек:*\n\nВам нужно привязать НЕкастодиальный кошелек сети TON -\nРекомендуем - _Tonkeeper\\Tonhub\\MyTonWallet_')

#Twitter
Twitter_message = ('Вкладка не привязана к Twitter!\nОбратитесь за привязкой!')

#TERMS ENGLISH
TermsENG_message = ('The conditions of participation in AIRDROP have never been so simple\n😱Absolutely every participant will receive $SMILE tokens 🔥\n\nTo participate, you need to:\n1. be subscribed to the channel: @smiletonn\n2. Invite all your friends\n\nFor each friend you refer, you will receive 200 $SMILE\nTo double your referral balance, fulfill the additional bonus condition in the Twitter tab [BONUS].\n\nYou can invite friends via your personal referral link: Link\n\n_invite👇🏼_')